posts/reading/gradle-in-action/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Gradle In Action | Warren Liu</title>
<link href="../../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../../rss.xml">
<link rel="canonical" href="https://example.com/posts/reading/gradle-in-action/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Warren Liu">
<link rel="prev" href="../lean-python/" title="Lean Python" type="text/html">
<link rel="next" href="../introducing-go/" title="Introducing Go" type="text/html">
<meta property="og:site_name" content="Warren Liu">
<meta property="og:title" content="Gradle In Action">
<meta property="og:url" content="https://example.com/posts/reading/gradle-in-action/">
<meta property="og:description" content="Table of Contents


Getting started
Using the command line
Using the java plugin






Getting started


An hello world example:
task helloWorld {
  doLast {
    println 'Hello world!'
  }
}


Execute">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-15T00:00:00+01:00">
<meta property="article:tag" content="gradle">
<meta property="article:tag" content="java">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">Warren Liu</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../../archive.html">Archive</a>
                </li>
<li>
<a href="../../../categories/">Tags</a>
                </li>
<li>
<a href="../../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Gradle In Action</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Warren Liu
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2017-07-15T00:00:00+01:00" itemprop="datePublished" title="2017-07-15 00:00">2017-07-15 00:00</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Getting started</a></li>
<li><a href="#sec-2">Using the command line</a></li>
<li><a href="#sec-3">Using the java plugin</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Getting started</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>An hello world example:
<div class="highlight"><pre><span></span><span class="n">task</span> <span class="n">helloWorld</span> <span class="o">{</span>
  <span class="n">doLast</span> <span class="o">{</span>
    <span class="n">println</span> <span class="s1">'Hello world!'</span>
  <span class="o">}</span>
<span class="o">}</span>
</pre></div>
<ul class="org-ul">
<li>Execute the build script with <code>gradle -q helloWorld</code>, the <code>-q</code>
    tell Gradle only ouptut the task's output.
</li>
<li>Tasks and actions are important elements of the language.
</li>
<li>An <code>Action</code> doLast specify it is the last action that's executed
for a task.
</li>
<li>In a more concise way of same logic using <code>&lt;&lt;</code>
<div class="highlight"><pre><span></span><span class="n">task</span> <span class="n">helloWorld</span> <span class="o">&lt;&lt;</span> <span class="o">{</span>
   <span class="n">println</span> <span class="s1">'Hello world!'</span>
<span class="o">}</span>
</pre></div>
</li>
</ul>
</li>
<li>Dynamic task definition and task chaining
<div class="highlight"><pre><span></span><span class="n">task</span> <span class="n">startSession</span> <span class="o">&lt;&lt;</span> <span class="o">{</span>
  <span class="n">chant</span><span class="o">()</span>
<span class="o">}</span>

<span class="kt">def</span> <span class="nf">chant</span><span class="o">()</span> <span class="o">{</span>
   <span class="n">ant</span><span class="o">.</span><span class="na">echo</span><span class="o">(</span><span class="nl">message:</span> <span class="s1">'Repeat after me...'</span><span class="o">)</span>
<span class="o">}</span>

<span class="mi">3</span><span class="o">.</span><span class="na">times</span> <span class="o">{</span>
   <span class="n">task</span> <span class="s2">"YayGradle$it"</span> <span class="o">&lt;&lt;</span> <span class="o">{</span>
      <span class="n">println</span> <span class="s1">'Gradle rocks'</span>
   <span class="o">}</span>
<span class="o">}</span>

<span class="n">yayGradle0</span><span class="o">.</span><span class="na">dependsOn</span> <span class="n">startSession</span>
<span class="n">yayGradle2</span><span class="o">.</span><span class="na">dependsOn</span> <span class="n">yayGradle1</span><span class="o">,</span> <span class="n">yayGradle0</span>

<span class="n">task</span> <span class="nf">groupTherapy</span><span class="o">(</span><span class="nl">dependsOn:</span> <span class="n">yaygradle2</span><span class="o">)</span>
</pre></div>
<ul class="org-ul">
<li>
<code>task</code> can be used to dynamically define tasks
</li>
<li>
<code>dependsOn</code> defines dependencies between tasks
</li>
<li>Gradle is tight integrated with Ant. Every script is equipped with
a property call <code>ant</code> that grants direct access to Ant tasks
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Using the command line</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>list available tasks of a project: <br><code>gradle -q tasks</code>
</li>
<li>list all available properties: <br><code>gradle properties</code>
</li>
<li>task execution: can execute multiple tasks in a single build run <br><code>gradle yayGradle0 groupTherapy</code>
<ul class="org-ul">
<li>will execute the task <code>yayGradle0</code> first then task <code>groupTherapy</code> second.
</li>
<li>Tasks are always executed just <b>once</b>.
</li>
<li>Gradle can abbreviate camel-cased task name on the command
line. So the command below is same as above <br><code>gradle yG0 gT</code>
</li>
<li>However, the abbreviation has to be unique
</li>
</ul>
</li>
<li>
<b>exclude</b> a task and its dependent tasks: <br><code>gradle groupTherapy -x yayGradle0</code>
</li>
<li>specify a <b>build file</b> with <code>-b, --build-file</code>
</li>
<li>
<b>build offline</b> with <code>offline</code> to only check the local dependency
cache for dependencies.
</li>
<li>set property option:
<ul class="org-ul">
<li>
<code>-D, --system-prop</code> : set jvm system property
</li>
<li>
<code>-P, --project-prop</code> : set project properties, which are variables
available in your build script.
</li>
</ul>
</li>
<li>logging: <code>-i, --info</code>, <code>-s --stacktrace</code>, <code>-q, --quite</code>
</li>
<li>Gradle daemon: <code>--daemon</code>
<ul class="org-ul">
<li>subsequent invocations of the <code>gradle</code> command will now reuse the
daemon process.
</li>
<li>The daemon process will automatically expire after a three-hour
idle time.
</li>
<li>At any time you can choose to build without using the daemon with
<code>--no-daemon</code>
</li>
<li>To stop the daemon <code>gradle --stop</code>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Using the java plugin</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Tell your project to use the Java plugin: <br>
  ~apply plugin: 'java'~
</li>
<li>Using <code>build</code> task to compile, run test and assembles the Jar.
</li>
<li>
</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../../categories/gradle/" rel="tag">gradle</a></li>
            <li><a class="tag p-category" href="../../../categories/java/" rel="tag">java</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../lean-python/" rel="prev" title="Lean Python">Previous post</a>
            </li>
            <li class="next">
                <a href="../introducing-go/" rel="next" title="Introducing Go">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:n.tesla@example.com">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
